In [ ]:
Question 1:

In [1]:
import pandas as pd
print(pd.__version__)

1.0.5

In [ ]:
Question 2:

In [2]:
import pandas as pd
data =([ 'a','b','c','d','e','f'])
series_data = pd.Series(data)
print(series_data)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [3]:
import pandas as pd
data=({1:'a',2:'b',3:'c',4:'d'})
s=pd.Series(data)
print(s)

1    a
2    b
3    c
4    d
dtype: object

In [ ]:
Question 3:

In [4]:
import pandas as pd
df=pd.read_csv("marks.csv")
df.head()
pd.DataFrame(df,columns=["Student"])

    Student
0     Anish
1   Rishabh
2      Ajay
3   Abhinav
4    Anurag
..      ...
95  Aaditya
96    vivek
97    Tisha
98   Raghav
99   Ishita

[100 rows x 1 columns]

In [6]:
pd.DataFrame(df,columns=["Student","Overall Marks"])

    Student  Overall Marks
0     Anish           9700
1   Rishabh             83
2      Ajay             78
3   Abhinav             86
4    Anurag             91
..      ...            ...
95  Aaditya             77
96    vivek             55
97    Tisha              7
98   Raghav             73
99   Ishita             82

[100 rows x 2 columns]

In [ ]:
Question 4:

In [7]:
import seaborn as sb
tips =sb.load_dataset('mpg')
tips.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [ ]:
Question 5:

In [8]:
import seaborn as sb
df =sb.load_dataset('mpg')
df.head()
df.origin.unique()

array(['usa', 'japan', 'europe'], dtype=object)

In [ ]:
Question 6:

In [9]:
import seaborn as sb
df =sb.load_dataset('mpg')
df.head()
df.origin.unique()
df[df['origin'].str.contains("usa")]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
392,27.0,4,151.0,90.0,2950,17.3,82,usa,chevrolet camaro
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10